In [1]:
import pandas as pd

#### 导入txt文件

In [2]:
pd.read_table("testFile.txt",encoding="utf-8")

   姓名  年龄   工作     薪水       入职日期
0  张三  30  CEO  50000  2010/3/11
1  李四  24   主管  30000  2018/8/19
2  王五  25   经理  40000   2018/9/5

In [3]:
pd.read_table("testFile.txt",encoding="utf-8",sep=",")#以逗号作为分隔符查看文件（不起作用）这是因为txt文件默认的分隔符不是逗号

            姓名\t年龄\t工作\t薪水\t入职日期
0  张三\t30\tCEO\t50000\t2010/3/11
1   李四\t24\t主管\t30000\t2018/8/19
2    王五\t25\t经理\t40000\t2018/9/5

In [4]:
pd.read_table("testFile.txt",encoding="utf-8",sep="\t")#使用txt文件默认的分割符

   姓名  年龄   工作     薪水       入职日期
0  张三  30  CEO  50000  2010/3/11
1  李四  24   主管  30000  2018/8/19
2  王五  25   经理  40000   2018/9/5

#### 使用read_table()导入csv文件

In [5]:
pd.read_table("excelTest.csv",encoding="utf-8")

            姓名,年龄,工作,薪水,入职日期
0  张三,30,CEO,50000,2010/3/11
1   李四,24,主管,30000,2018/8/19
2  王五,25,经理,40000,2015/10/11

In [6]:
#在读取文件的时候指定分隔符
pd.read_table("excelTest.csv",encoding="utf-8",sep="\t")#csv文件默认的分隔符是“\t”

            姓名,年龄,工作,薪水,入职日期
0  张三,30,CEO,50000,2010/3/11
1   李四,24,主管,30000,2018/8/19
2  王五,25,经理,40000,2015/10/11